In [1]:
# import libraries
import pandas as pd

In [96]:
df = pd.read_csv('NRP.csv', encoding='windows-1252') # 
df.head()

,Name,Age,Location,Crime,Date
0,William HUME,50 Yrs,No Fixed Address,"['', '', '\xa0Break and Enter', 'Fail to Atten...",2023.08.30
1,Paul ST PIERRE,46 Yrs,No Fixed Address,"['', '', 'Break and Enter x3', '', '', '23-885...",2023.08.30
2,Kipp DALE-PAISLEY,32 Yrs,St Catharines,"['', '', 'Assault', '', '', '23-91405', '', '']",2023.08.30
3,Peter THOMAS,46 yrs,Welland,"['', '', 'Fail to Comply Release Order', '', '...",2023.08.30
4,Rachel FRASER,32 yrs,Welland,"['', '', 'Fail to Attend Court', '', '', '23-9...",2023.08.30

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 142 entries, 0 to 141
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      142 non-null    object
 1   Age       28 non-null     object
 2   Location  28 non-null     object
 3   Crime     142 non-null    object
 4   Date      142 non-null    object
dtypes: object(5)
memory usage: 5.7+ KB

In [36]:
df.isnull().sum() # check the null values

Name          0
Age         114
Location    114
Crime         0
Date          0
dtype: int64

In [61]:
len(df)

142

In [150]:

for i in range(len(df)):
        if df.isnull().iloc[i,1]:
                df.iloc[i,1]= df['age2'][i][0]

In [167]:
df.tail()

,Name,Age,Location,Crime,Date,age2,age3
137,Jeremy WALL,['40 yrs','Fort Erie',"['40 yrs', '', '', 'Fort Erie', '', '', '', ''...",updated: 2018.12.12,"[['40 yrs', '', '', 'Fort Erie', '', '', ...",['40 yrs'
138,Noel TONER,['33 yrs','Niagara Falls\xa0',"['33 yrs', '', '', 'Niagara Falls\xa0', '', ''...",updated: 2018.12.12,"[['33 yrs', '', '', 'Niagara Falls\xa0', '...",['33 yrs'
139,Michael ANNIS,['46 yrs','Niagara Falls',"['46 yrs', '', '', 'Niagara Falls', '', '', ''...",2017.04.05,"[['46 yrs', '', '', 'Niagara Falls', '', ...",['46 yrs'
140,"Andrew DEWEESE,",['30 Yrs','Niagara Falls',"['30 Yrs', '', '', 'Niagara Falls', '', '', ''...",2016.11.01,"[['30 Yrs', '', '', 'Niagara Falls', '', ...",['30 Yrs'
141,Richard BARTSCHER,['39 yrs','Niagara Falls',"['39 yrs', '', '', 'Niagara Falls', '', '', '\...",2016.08.01,"[['39 yrs', '', '', 'Niagara Falls', '', ...",['39 yrs'

In [165]:
for i in range(len(df)):
        if df.isnull().iloc[i,2]:
                df.iloc[i,2]= df['age2'][i][3]

In [168]:
df.isnull().sum()

Name        0
Age         0
Location    0
Crime       0
Date        0
age2        0
age3        0
dtype: int64

In [169]:
import re